[
  {
    "event": "JEE Main 2023 Exam Dates Announced",
    "description": "National Testing Agency (NTA) has officially released the schedule for JEE Main 2023 examinations."
  },
  {
    "event": "IIT Bombay Introduces New B.Tech Program",
    "description": "Indian Institute of Technology (IIT) Bombay has added a cutting-edge B.Tech program to its course offerings for the upcoming academic year."
  },
  {
    "event": "NIT Trichy Admission Process Begins",
    "description": "National Institute of Technology (NIT) Trichy has commenced the admission process for its undergraduate programs. Interested candidates can now apply online."
  },
  {
    "event": "IIIT Hyderabad Announces Research Fellowship",
    "description": "International Institute of Information Technology (IIIT) Hyderabad is inviting applications for its research fellowship program. This is a great opportunity for aspiring researchers."
  },
  {
    "event": "BITS Pilani Conducts Counselling for Admissions",
    "description": "Birla Institute of Technology and Science (BITS) Pilani is conducting counselling sessions for students seeking admission to its various undergraduate and postgraduate programs."
  },
  {
    "event": "SRM University's New Engineering Labs Inaugurated",
    "description": "SRM Institute of Science and Technology has inaugurated state-of-the-art engineering labs, enhancing the practical learning experience for students."
  },
  {
    "event": "VIT Vellore Releases Merit List",
    "description": "Vellore Institute of Technology (VIT) has published the merit list for its engineering programs. Applicants can check their ranking on the official website."
  },
  {
    "event": "IISC Bangalore Introduces Specialization in AI",
    "description": "Indian Institute of Science (IISC) Bangalore is offering a new specialization in Artificial Intelligence for students pursuing their master's degrees."
  },
  {
    "event": "Manipal University's Entrance Exam Dates Declared",
    "description": "Manipal Academy of Higher Education has announced the dates for its entrance exams. Prospective students should mark their calendars accordingly."
  },
  {
    "event": "Thapar Institute Extends Application Deadline",
    "description": "Thapar Institute of Engineering and Technology has extended the deadline for submitting applications. Aspiring students now have more time to apply for their preferred programs."
  }
]
